src/Enums/ТипыОтветовREST/ТипыОтветовREST.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОтветовREST</name>
  <enumValues>
    <name>Успешно</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаНеКорректныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаНеАвторизован</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаНетДоступа</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаНеНайдено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаМетодНеПоддерживается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаСпецификации</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыОтветовREST/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПользовательскиеВидыОтветов() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.ТипыОтветовREST.Успешно					, 200);
	Результат.Вставить(Перечисления.ТипыОтветовREST.ОшибкаНеКорректныйЗапрос, 400);
	Результат.Вставить(Перечисления.ТипыОтветовREST.ОшибкаНеНайдено			, 404);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСлужебныеВидыОтветов() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.ТипыОтветовREST.ОшибкаНеАвторизован			, 401);
	Результат.Вставить(Перечисления.ТипыОтветовREST.ОшибкаНетДоступа			, 403);
	Результат.Вставить(Перечисления.ТипыОтветовREST.ОшибкаНеНайдено				, 404);
	Результат.Вставить(Перечисления.ТипыОтветовREST.ОшибкаМетодНеПоддерживается	, 405);
	Результат.Вставить(Перечисления.ТипыОтветовREST.ОшибкаСпецификации			, 422);
	Результат.Вставить(Перечисления.ТипыОтветовREST.ВнутренняяОшибка			, 500);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
